app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 1], ["receiver_id", 11], ["created_at", "2025-05-02 21:58:34.771889"], ["updated_at", "2025-05-02 21:58:34.771889"]]
---
  def create
    @chat = Chat.new(chat_params)
    if @chat.save