app/controllers/messages_controller.rb

INSERT INTO "messages" ("chat_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chat_id", 6], ["user_id", 1], ["body", "Hola Benjamin Cano"], ["created_at", "2025-05-02 21:58:55.553191"], ["updated_at", "2025-05-02 21:58:55.553191"]]
---
  def create
    @message = Message.new(message_params)
    if @message.save