app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "benjamincano@gmail.com"], ["first_name", "Benjamin"], ["last_name", "Cano"], ["created_at", "2025-05-02 21:58:26.493385"], ["updated_at", "2025-05-02 21:58:26.493385"]]
---
  def create
    @user = User.new(user_params)
    if @user.save